<a href="https://colab.research.google.com/github/ragcode7/DS-SEM5/blob/main/Lab2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [12]:
import pandas as pd
data = pd.read_csv('uk-500.csv')
data.describe()
data.info()
data.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    500 non-null    object
 1   last_name     500 non-null    object
 2   company_name  500 non-null    object
 3   address       500 non-null    object
 4   city          500 non-null    object
 5   county        500 non-null    object
 6   postal        500 non-null    object
 7   phone1        500 non-null    object
 8   phone2        500 non-null    object
 9   email         500 non-null    object
 10  web           500 non-null    object
dtypes: object(11)
memory usage: 43.1+ KB

(500, 11)

##Dataframe indexing

In [7]:
data.iloc[0]

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
Name: 0, dtype: object

In [9]:
data.iloc[1]

first_name                                   Evan
last_name                               Zigomalas
company_name                   Cap Gemini America
address                               5 Binney St
city                                   Abbey Ward
county                            Buckinghamshire
postal                                   HP11 2AX
phone1                               01937-864715
phone2                               01714-737668
email                    evan.zigomalas@gmail.com
web             http://www.capgeminiamerica.co.uk
Name: 1, dtype: object

499th row

In [8]:
data.iloc[-1]

first_name                                               Mi
last_name                                            Richan
company_name                 Nelson Wright Haworth Golf Crs
address                                     6 Norwood Grove
city                                      Tanworth-in-Arden
county                                         Warwickshire
postal                                              B94 5RZ
phone1                                         01451-785624
phone2                                         01202-738406
email                                        mi@hotmail.com
web             http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: 499, dtype: object

#selecting columns

In [13]:
data.iloc[:,1]

0      Tomkiewicz
1       Zigomalas
2         Andrade
3       Mcwalters
4          Veness
          ...
495          Veit
496       Euresti
497      Brenning
498         Keeny
499        Richan
Name: last_name, Length: 500, dtype: object

In [14]:
data.iloc[:,-1]

0             http://www.alandrosenburgcpapc.co.uk
1                http://www.capgeminiamerica.co.uk
2                 http://www.elliottjohnwesq.co.uk
3                     http://www.mcmahanbenl.co.uk
4                   http://www.champagneroom.co.uk
                          ...
495      http://www.plazagourmetdelicatessen.co.uk
496             http://www.fitzgeraldedwardj.co.uk
497               http://www.fureyassociates.co.uk
498         http://www.bfgfederalcreditunion.co.uk
499    http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: web, Length: 500, dtype: object

select only n rows

In [15]:
#first 
data.iloc[0:5]

  first_name  ...                                   web
0    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
1       Evan  ...     http://www.capgeminiamerica.co.uk
2     France  ...      http://www.elliottjohnwesq.co.uk
3    Ulysses  ...          http://www.mcmahanbenl.co.uk
4     Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 11 columns]

first two colums

In [16]:
data.iloc[:,0:2]

    first_name   last_name
0      Aleshia  Tomkiewicz
1         Evan   Zigomalas
2       France     Andrade
3      Ulysses   Mcwalters
4       Tyisha      Veness
..         ...         ...
495      Avery        Veit
496       Reid     Euresti
497  Charlette    Brenning
498  Celestina       Keeny
499         Mi      Richan

[500 rows x 2 columns]

select a set of rows and columns

In [17]:
data.iloc[[0,3,6,24],[0,5,6]]

   first_name        county    postal
0     Aleshia          Kent   CT2 7PP
3     Ulysses  Lincolnshire  DN36 5RP
6        Marg   Southampton  SO14 3TY
24       Tess   West Sussex  PO19 1RH

In [18]:
data.iloc[0:5,5:8]

            county    postal        phone1
0             Kent   CT2 7PP  01835-703597
1  Buckinghamshire  HP11 2AX  01937-864715
2      Bournemouth   BH6 3BE  01347-368222
3     Lincolnshire  DN36 5RP  01912-771311
4    West Midlands   B70 9DT  01547-429341

To be indexed on the last name

In [19]:
data.set_index("last_name",inplace=True)
data.head()

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
Zigomalas        Evan  ...     http://www.capgeminiamerica.co.uk
Andrade        France  ...      http://www.elliottjohnwesq.co.uk
Mcwalters     Ulysses  ...          http://www.mcmahanbenl.co.uk
Veness         Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 10 columns]

inlcude the nth row/column as well. (loc b/c based on values in record)

In [23]:
data.loc[['Andrade','Veness'],'city':'email']

                                     city  ...                       email
last_name                                  ...
Andrade    East Southbourne and Tuckton W  ...  france.andrade@hotmail.com
Veness         Greets Green and Lyng Ward  ...   tyisha.veness@hotmail.com

[2 rows x 6 columns]

In [26]:
data.loc[data['first_name']=='Antonio', 'city':'email']

                                      city  ...                            email
last_name                                   ...
Villamarin  Little Parndon and Hare Street  ...     antonio.villamarin@gmail.com
Glasford                    Gaer Community  ...  antonio_glasford@glasford.co.uk
Heilig                            Ipplepen  ...         antonio.heilig@gmail.com

[3 rows x 6 columns]

In [30]:
data.loc[((data['county']=='Kent')& (data['first_name']=='Aleshia')),'city':'email']

                         city county  ...        phone2                    email
last_name                             ...
Tomkiewicz  St. Stephens Ward   Kent  ...  01944-369967  atomkiewicz@hotmail.com

[1 rows x 6 columns]

In [27]:
#display all the gamil ids
data.loc[data['email'].str.endswith("gmail.com")]

            first_name  ...                                      web
last_name               ...
Zigomalas         Evan  ...        http://www.capgeminiamerica.co.uk
Erm        Charlesetta  ...            http://www.cainjohnmesq.co.uk
Jaret         Corrinne  ...         http://www.soundvisioncorp.co.uk
Quarto           Karma  ...            http://www.jcsmachinery.co.uk
Savidge          Milly  ...  http://www.bridgewayplanforhealth.co.uk
...                ...  ...                                      ...
Picciuto           Mel  ...           http://www.avantelimited.co.uk
Machalek       Tijuana  ...      http://www.schwartzthomaseesq.co.uk
Dolloff        Derrick  ...   http://www.prototekmanufacturing.co.uk
Katie           Alesia  ...  http://www.nelsonstrmtpestcntrlco.co.uk
Keeny        Celestina  ...   http://www.bfgfederalcreditunion.co.uk

[130 rows x 10 columns]

In [31]:
#Display all persons whose first name contains France or Tyisha or Eric
data.loc[data['first_name'].isin(['France','Tyisha','Eric'])]

          first_name  ...                                   web
last_name             ...
Andrade       France  ...      http://www.elliottjohnwesq.co.uk
Veness        Tyisha  ...        http://www.champagneroom.co.uk
Rampy           Eric  ...  http://www.thompsonmichaelcesq.co.uk

[3 rows x 10 columns]

In [32]:
#Display people with first name as Antonio and gmail id
data.loc[data['email'].str.endswith("gmail.com")&(data['first_name']=='Antonio')]

           first_name  ...                                  web
last_name              ...
Villamarin    Antonio  ...     http://www.combssheetmetal.co.uk
Heilig        Antonio  ...  http://www.radissonsuitehotel.co.uk

[2 rows x 10 columns]

In [34]:
#lambda=  a lambda function is just like any normal python function, except that it has no name when defining it, and it is contained in one line of code. 
#A lambda function evaluates an expression for a given argument. You give the function a value (argument) and then provide the operation (expression.
#less space, result immediately
#split function 
#len = length function
#operation on company name, splitting based on space. Company name with 4 words ( 4 spaces) 

#Actual query = Dispaly all persons with company name containing 4 words
data.loc[data['company_name'].apply(lambda x:len(x.split(' '))==4)]

            first_name  ...                                         web
last_name               ...
Andrade         France  ...            http://www.elliottjohnwesq.co.uk
Rampy             Eric  ...        http://www.thompsonmichaelcesq.co.uk
Erm        Charlesetta  ...               http://www.cainjohnmesq.co.uk
Throssell      Michell  ...            http://www.weissspirtguyer.co.uk
Kanne            Edgar  ...          http://www.crowankennethwesq.co.uk
...                ...  ...                                         ...
Alsaqri          Ahmad  ...  http://www.allianceconstructioncoinc.co.uk
Reibman     Jacquelyne  ...          http://www.greatclipsforhair.co.uk
Kono          Isabelle  ...  http://www.rockspringspetroleumequip.co.uk
Fiorino         Elbert  ...           http://www.donaldgnelsonesq.co.uk
Keeny        Celestina  ...      http://www.bfgfederalcreditunion.co.uk

[192 rows x 10 columns]

In [36]:
#when it does not exist
data.loc[((data['county']=='Kent') & (['first_name']=='Dheeraj'))]

Empty DataFrame
Columns: [first_name, company_name, address, city, county, postal, phone1, phone2, email, web]
Index: []

read from webcontent instead of downloading/uploading

In [37]:
df=pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/cabinet-turnover/cabinet-turnover.csv')

In [50]:
df.head()

  president                                  position  ... length   days
0    Carter                              OMB Director  ...    245  247.0
1    Carter               Secretary of Transportation  ...    908  912.0
2    Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3    Carter  Secretary of Housing & Urban Development  ...    922  926.0
4    Carter                 Secretary of the Treasury  ...    923  927.0

[5 rows x 7 columns]

In [51]:
df.describe()

              days
count   288.000000
mean   1861.506944
std     832.302520
min     190.000000
25%    1442.000000
50%    1487.000000
75%    2922.000000
max    3013.000000

In [52]:
df.shape

(312, 7)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312 entries, 0 to 311
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   president  312 non-null    object
 1   position   312 non-null    object
 2   appointee  312 non-null    object
 3   start      312 non-null    object
 4   end        312 non-null    object
 5   length     294 non-null    object
 6   days       288 non-null    float64
dtypes: float64(1), object(6)
memory usage: 17.2+ KB

In [47]:
#nonunique and unique
df['president'].nunique()

7

In [49]:
#strings containing secretary 
df.loc[df.position.str.contains("Secretary")]

    president                                  position  ... length   days
1      Carter               Secretary of Transportation  ...    908  912.0
2      Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3      Carter  Secretary of Housing & Urban Development  ...    922  926.0
4      Carter                 Secretary of the Treasury  ...    923  927.0
7      Carter                       Secretary of Energy  ...    747  946.0
..        ...                                       ...  ...    ...    ...
305     Trump                        Secretary of Labor  ...    NaN    NaN
307     Trump            Secretary of Homeland Security  ...    NaN    NaN
308     Trump      Secretary of Health & Human Services  ...    NaN    NaN
309     Trump                        Secretary of State  ...    NaN    NaN
311     Trump             Secretary of Veterans Affairs  ...    NaN    NaN

[175 rows x 7 columns]

In [48]:
df.loc[(df['president']=='Clinton')&(df.position.str.contains("OMB Director"))]['appointee']

122    Leon Panetta
129    Alice Rivlin
142    Frank Raines
151        Jack Lew
Name: appointee, dtype: object